{
  "about": {
    "title": "All-in-One Nintendo Switch Updater",
    "copyright": "AIO-Switch-Updater est publié sous la license GPL-3.0",
    "disclaimers": "◆ HamletDuFromage n'héberge rien à l'exception d'une copie des codes de triche du topic principal de GBAtemp. Ils sont attribués à leurs propriétaires respectifs.\n Les liens sont actualisés toutes les 30 minutes. Si un lien reste inactif après 30 minutes, merci de bien vouloir ouvrir une issue sur GitHub.",
    "donate": "◆ Vous aimez cette application ? Faites un don pour soutenir son développement : 'https://git.io/donate_homlet'"
  },
  "cheats": {
    "installed": "Codes de triche installés",
    "label": "Des codes de triche ont été ajoutés aux titres suivants depuis votre dernière utilisation de l'application. Sachez que même si ils ont été téléchargés, la compatibilité de ces codes avec la version actuelle de votre jeu n'est pas garantie.",
    "downloading": "Téléchargement de :\nDerniers codes de triche\n\nDepuis :\n",
    "dl_latest": "Télécharger l'archive de codes de triche la plus récente",
    "getting_cheats": "Téléchargement des codes de triche",
    "menu": "Menu de triche",
    "view": "Voir les codes de triche installés",
    "exclude": "Exclure des jeux lors de la mise à jour des codes de triche",
    "delete_existing": "Supprimer tous les codes de triche",
    "delete_orphaned": "Supprimer les codes de triche orphelins",
    "deleting": "Suppression…",
    "cheatslips_title": "Codes de triche de Cheat Slips",
    "gbatemp_title": "Codes de triche de GBAtemp.net",
    "get_gbatemp": "Télécharger les codes de triche individuellement",
    "get_cheatslips": "Télécharger les codes de triche de Cheat Slips",
    "cheats_label": "◆ Télécharger des codes de triches individuels depuis la base de données de GBAtemp.net ou des listes de codes depuis Cheat Slips",
    "cheatslips_dl": "Télécharger une sélection de listes de codes de Cheat Slips.\nCes codes de triche seront ajoutés à la fin de du fichier de triche existant.",
    "delete_file": "Supprimer le fichier de triche existant",
    "cheatslips_error": "Impossible de télécharger les codes de triche sélectionnés/token invalide.",
    "quota": "Quota dépassé pour aujourd'hui !\nConsultez 'https://www.cheatslips.com/subscriptions' pour savoir comment l'augmenter.",
    "sheet_content": "Contenu de la liste de codes",
    "cheatslips_select": "Sélectionner un jeu pour télécharger ses codes de triche.",
    "cheatslips_wrong_id": "Impossible de récupérer le token, vérifiez que vous avez bien renseigné vos identifiants",
    "kb_error": "Si le clavier n'apparaît pas, esayez de lancer l'application avec un accès complet à la RAM (redirection d'application)",
    "cheatslips_see_more": "Voir plus",
    "cheatslips_dl_cheats": "Téléchargement des codes de triche et retour",
    "bid_not_found": "Impossible d'obtenir l'ID de version. Essayez de lancer AIO-Switch-Updater en mode applet quand le jeu est en cours d'exécution.",
    "exclude_titles": "Exclure des titres",
    "exclude_titles_desc": "Vous pouvez desactiver les mises à jour des codes de triche dans ce menu",
    "exclude_titles_save": "Enregistrer et retour",
    "dl_all": "Télécharger et extraire toute l'archive de triche de GBAtemp.net",
    "gbatemp_dl": "Télécharger les codes de triche archivés par GBAtemp.net. Ces codes seront ajoutés à la fin du fichier de triche existant.",
    "gbatemp_dl_cheatcode": "Télécharger un code de triche",
    "gbatemp_dl_successful_dl": "Téléchargement du code de triche réussi :\n{}",
    "applet_mode_not_supported": "À cause de contraintes de mémoire du mode applet, vous ne pouvez récupérer que les codes de triche pour le jeu auquel vous être en train de jouer. Pour télécharger les codes de triche de tout autre jeu installé, veuillez lancer AIO-Switch-Updater via la redirection d'application.",
    "cheatfile_label": "Voici les codes de triche listés dans le fichier {}",
    "not_found": "Aucun code de triche valide n'a été trouvé pour ce jeu",
    "show_existing": "Montrer les codes de triche existants",
    "delete_cheats": "Supprimer les codes de triche pour ce jeu",
    "deletion_error": "Impossible de supprimer les fichiers de triche pour les jeux avec les ID suivants :\n{}",
    "show_cheat_files": "Montrer tous les fichiers de triche",
    "cheats_not_found": "Impossible de trouver des codes de triche correspondant à cet ID de build."
  },
  "common": {
    "downloading": "Téléchargement en cours…",
    "extracting": "Extraction en cours…",
    "all_done": " Terminé !",
    "back": "Retour",
    "continue": "Continuer",
    "download": "Téléchargement en cours :\n",
    "from": "\n\nLien complet :\n",
    "ok": "OK",
    "shut_down": "Éteindre",
    "reboot": "Redémarrer",
    "updating": "Mise à jour de l'application",
    "no": "Non",
    "yes": "Oui",
    "go_back": "Retour",
    "confirm": "Confirmer",
    "cancel": "Annuler",
    "off": "Non",
    "selected": "Sélectionné",
    "applet_mode_not_supported": "Cette fonctionnalité n'est pas disponible en mode applet. Veuillez lancer AIO-Switch-Updater via la redirection d'application pour l'utiliser."
  },
  "changelog": {
    "changelog": "Journal des modifications"
  },
  "payloads": {
    "dl_payloads": "Téléchargement des payloads",
    "select": "Selectionner un payload vers lequel redémarrer.",
    "set_reboot_payload": "Choisir comme reboot_payload.bin",
    "set_update_bin": "Choisir comme /bootloader/update.bin",
    "copy_success": "Copie de `{}` à `{}` réussie."
  },
  "joy_con": {
    "title": "Modification de la couleur des Joy-Con",
    "description": "Vous pouvez changer la couleur interne des Joy-Cons. Vérifiez qu'ils soient bien attachés à la Switch.\nLes profils de couleur se trouvent dans `{}`. Visitez '{}' pour générer des profils personalisés.",
    "backup": "Sauvegarde du profil de couleur actuel",
    "label": "Modification de la couleur des Joy-Con",
    "backing_up": "Sauvegarde du profil de couleur actuel. Vérifiez que les Joy-Cons soient bien attachés à la Switch. Si le logiciel se bloque, essayez d'attacher/détacher les Joy-Cons.",
    "changing": "Changement de couleur. Vérifiez que les Joy-Cons soient bien attachés à la Switch. Si le logiciel se bloque, essayez d'attacher/détacher les Joy-Cons.",
    "all_done": "Terminé ! Vous devrez peut-être attacher/détacher les Joy-Cons pour que les modifications prennent effet."
  },
  "pro_con": {
    "title": "Modification de la couleur de la manette Pro",
    "desc": "Vous pouvez changer la couleur interne de la manette Pro. Vérifiez qu'elle soit réglée sur joueur 1.",
    "warning": "AIO-Switch-Updater ne permet pas encore de changer la couleur des poignées des manettes pro. Utilisez plutôt Joy-Con Toolkit sur PC.",
    "label": "Modification de la couleur de la manette Pro",
    "backing_up": "Sauvegarde du profil de couleur. ",
    "all_done": "Terminé ! Vous devrez peut-être éteindre et redémarrer la manette pour que les changements prennent effet.",
    "changing": "Changement de la couleur. Vérifiez que la manette Pro soit bien réglée sur joueur 1."
  },
  "main": {
    "getting": "Téléchargement de {}",
    "firmware_text": "◆ Firmware archivé sur 'https://darthsternie.net/switch-firmwares/'. Une fois téléchargé, ils sera extrait dans '/firmware'. Vous pouvez ensuite installer la mise à jour avec Daybreak.\n FW installé : ",
    "cheats_text": "◆ Ceci téléchargera une archive de codes de triche mise à jour quotidiennement depuis 'gbatemp.net'. Les codes de triche pour les jeux non installés pas ne seront pas extraits sur la carte SD. Vous pouvez désactiver la mises à jour des codes de triche pour les jeux de votre choix dans le menu 'Outils→Menu de triche'.\n Version des codes de triche installés : ",
    "get_cheats": "Télécharger l'archive de codes de triche de GBAtemp.net (ver {})",
    "get_all_cheats:": "Télécharger l'archive de codes de triche de GBAtemp.net",
    "firmware": "firmware",
    "not_found": "non trouvé",
    "latest_cheats": "Dernière version",
    "app": "application",
    "cfw": "CFW",
    "ams": "Atmosphère",
    "ams_text": "◆ Avec ce menu, vous pouvez télécharger et mettre à jour Atmosphère, le custom firmware nécessaire à l'utilisation de logiciels homebrew.",
    "cfw_text": "◆ CFWs et bootloaders alternatifs.",
    "bootloaders_text": "◆ Télécharger et mettre à jour les bootloaders.",
    "cheats": "codes de triche",
    "links_not_found": "Impossible de trouver un lien de téléchargement, vérifiez que la Switch soit connectée à internet.\nSi ce problème persiste, veuillez ouvrir une issue sur GitHub.",
    "new_update": "- Nouvelle MÀJ de l'application disponible",
    "about": "À propos",
    "update_ams": "MÀJ d'Atmosphère",
    "update_cfw": "MÀJ des CFW",
    "update_bootloaders": "MÀJ des bootloaders",
    "download_firmware": "Téléch. des firmwares",
    "download_cheats": "Téléch. de cheat codes",
    "tools": "Outils",
    "launch_warning": "Veuillez prendre connaissance des points suivants avant d'utiliser cette application :\n\n Renseignez-vous d'abord sur le processus de mise à jour manuel de la Switch. Cela vous aidera à mieux comprendre le fonctionnement de l'application et savoir quoi faire en cas de problème.\n Afin d'éviter tout risque de corruption de données, l'utilisation de cette application avec une carte SD formatée en exFAT est FORTEMENT déconseillé.\n\n Les dernières informations à propos des fonctionnalités ajoutées et/ou modifiées sont disponibles dans le menu Outils→Journal des modifications.\n\nCet écran ne sera pas réaffiché.",
    "footer_text": "v{} | {:.1f}Go disponibles",
    "theme_warning": "Il semblerait que vous avez installé un thème personnalisé, cela pourrait empêcher le système de démarrer après la mise à jour de votre firmware.\nIl est conseillé de le supprimer avant d'effectuer la mise à jour.",
    "payloads_label": "◆ Enregistrer les payloads RCM sous {}",
    "hekate_ipl_label": "◆ Télécharger une version minimale et prête à l'emploi du fichier de configuration hekate_ipl.ini. Le fichier hekate_ipl.ini déjà présent sera écrasé."
  },
  "hide": {
    "title": "Masquer des onglets",
    "desc": "Masquer des onglets dans le menu principal",
    "update_ams_deepsea": "Téléchargement d'Atmosphère et de DeepSea"
  },
  "tools": {
    "cheats": "Menu de triche",
    "joy_cons": "Changer la couleur des Joy-Cons",
    "pro_cons": "Changer la couleur de la manette Pro",
    "dl_payloads": "Télécharger les payloads vers",
    "inject_payloads": "Injecter un payload",
    "getting_payload": "Téléchargement du payload",
    "update_app": "Mettre à jour l'application (v{})",
    "dl_app": "Téléchargement en cours :\nAIO-switch-updater\n\nDepuis :\n",
    "changelog": "Journal des modifications",
    "clean_up": "Nettoyage des fichiers téléchargés",
    "hide_tabs": "Masquer des onglets",
    "internet_settings": "Modifier les paramètres internet",
    "browser": "Navigateur web",
    "batch_copy": "Copie de fichiers en groupe",
    "batch_copy_not_found": "Les fichiers suivants n'ont pas été trouvés et n'ont pas été copiés :",
    "batch_copy_config_not_found": "Cet outil permet d'automatiser la copie de fichiers vers des destinations spécifiques. Cela peut être utile selon votre bootloader/trinket. Récupérez copy_files.txt depuis 'https://git.io/aiosu_copyfiles', éditez-le et ajoutez-le à votre dossier config. La copie sera aussi effectuée après chaque mise à jour.",
    "language": "Changer la langue de l'application"
  },
  "utils": {
    "fw_warning": "En raison de la taille des archives FW, le téléchargement de firmwares en mode applet n'est pas pris en charge. Veuillez lancer l'application avec un accès complet à la RAM.",
    "overwrite": " Voulez-vous écraser le fichier existant ",
    "not_an_archive": "Le fichier téléchargé n'est pas une archive zip. Cela est probablement dû à un lien rompu. Si le problème persiste après plus de 30 minutes, veuillez ouvrir une issue sur GitHub.",
    "overwrite_inis": "Voulez-vous écraser les fichiers de configuration .ini déja présents ?",
    "set_hekate_reboot_payload": "Voulez-vous copier le payload Hekate `{}` vers `{}` ?"
  },
  "ams_update": {
    "reboot_rcm": "La Switch va maintenant finaliser l'installation en redémarrant avec un payload spécial.",
    "install_hekate": "Voulez-vous aussi télécharger hekate ?\nSi vous refusez, la Switch finalisera l'installation en redémarrerant avec un payload spécial.",
    "delete_contents": "Voulez-vous supprimer le dossier '/atmosphere/contents/' déjà présent ? Cela évitera les crashes si vous avez installé des sysmodules incompatibles avec la dernière version d'Atmosphère. Notez que cela entraînera la suppression de tous les sysmodules, mods et codes de triche déjà installés.",
    "delete_sysmodules_flags": "Voulez-vous supprimer tous les indicateurs de démarrage de sysmodules personnalisés ? Cela désactivera tous les sysmodules et évitera les crashes si vous avez installé des sysmodules incompatibles avec la dernière version d'Atmosphère.",
    "current_ams": "◆ Version actuelle d'Atmosphère :",
    "erista_rev": "◆ Modèle Erista",
    "mariko_rev": "◆ Modèle Mariko",
    "deepsea_builder": "Personnaliser DeepSea",
    "show_module_description": "Montrer la description du module",
    "depends_on": "Les modules suivants seront aussi installés :",
    "download_custom_deepsea": "Télécharger cette installation personnalisée de DeepSea",
    "get_custom_deepsea": "Installation personnalisée de DeepSea",
    "deepsea_label": "◆ Le CFW DeepSea de la Team Neptune est un pack regroupant Atmosphère, hekate et plusieurs apps homebrew.",
    "download_deepsea_package": "Compiler et télécharger",
    "cant_fetch_deepsea": "Impossible de récupérer les paquets. Ouvrez une issue GitHub si le problème persiste.",
    "build_your_deepsea": "Personnalisez l'installation de DeepSea en sélectionnant les paquets à inclure",
    "getting_ams": "Installer Atmopshère",
    "custom_packs_label": "◆ Voici les paquets listés dans le fichier {}. Assurez-vous de la fiabilité de leur source car il ne bénéficient d'aucun support de la part d'AIO-Switch-Updater."
  },
  "firmware": {
    "launch_daybreak": "Voulez-vous lancer Daybreak pour installer la mise à jour système téléchargée ?"
  },
  "net": {
    "title": "Paramètres internet"
  },
  "errors": {
    "insufficient_storage": "Il n'y a pas assez d'espace disponible sur la carte SD pour effectuer cette opération.",
    "error_message": "{}\nVeuillez réessayer un peu plus tard. Si le problème persiste, ouvrez une issue sur GitHub",
    "mariko_payload_missing": "Pour mettre à jour Atmopshère sur une Switch patchée, le payload doit être nommé \"payload.bin\" et être placé à la racine de votre carte SD."
  }
}